<template>
  <main>
    <div class="container">
      <h2>Условия покупки на blackm.com.pl</h2>
      <h3>-Определения-</h3>
      <p>1. <b>АДМИНИСТРАЦИЯ</b> – Люди, управляющие сервером blackmc.com.pl.</p>
      <p>2. <b>БАН</b> - Запрет на вход на сервер, установленный администрацией сервера blackmc.com.pl. Этот бан предоставляется лицу, нарушившему правила, расположенные на сервере blackmc.com.pl.</p>
      <p>3. <b>ПОТРЕБИТЕЛЬ</b> – Лицо, приобретающее услугу на сайте blackmc.com.pl.</p>
      <p>4. <b>АККАУНТ</b> – учетная запись Minecraft, идентифицируемая определенным именем пользователя, используемая на сервере blackmc.com.pl.</p>
      <p>5. <b>РЕГЛАМЕНТ</b> - Правила сайта, предшествующие покупке на сайте blackmc.com.pl.</p>
      <p>6. <b>СЕРВЕР</b> - сервер Minecraft, позволяющий играть с другими людьми с доменом blackmc.com.pl.</p>
      <br>
      <h3>-Основные положения-</h3>
      <p>1. Сайт с доменом blackmc.com.pl предлагает услуги на сервере Minecraft с доменом blackmc.com.pl.</p>
      <p>2. Все логотипы и графика, содержащиеся на сайте, являются собственностью сервера blackmc.com.pl и не могут быть использованы неавторизованными пользователями. Разрешение на использование графики можно получить, обратившись к администрации на платформе Discord или по E-MAIL: <b>bmcserwer@gmail.com</b>.</p>
      <p>3. Владелец сайта оставляет за собой право изменять функционал сайта blackmc.com.pl.</p>
      <p>4. Владелец сайта оставляет за собой право вносить изменения в правила, не информируя пользователей об изменениях.</p>
      <p>5. Каждый пользователь, совершающий покупку на сайте, обязан принять условия.</p>
      <br>
      <h3>-Информация о предлагаемых услугах-</h3>
      <p>1. Услуга предоставляется сразу после поступления оплаты.</p>
      <p>2. Если вы не получаете купленные услуги, отправьте сообщение администратору в приложении Discord с именем: <b>Sharyxxx#7724</b> или по электронной почте: <b>bmcserwer@gmail.com</b></p>
      <p>3. Администрация не несет ответственности за виртуальные предметы с момента их добавления в аккаунт пользователя.</p>
      <p>4. Администрация не несет ответственности за потерю аккаунта/взлом аккаунта, для которого была приобретена конкретная услуга/услуги. Сервер blackmc.com.pl имеет системы безопасности, которые предотвращают получение данных для входа или доступ к учетной записи без авторизации.</p>
      <p>5. Администрация может отказать в продаже услуги и вернуть деньги переводом на банковский счет или счет PayPal в сумме после вычета комиссии.</p>
      <p>6. Человек, которого забанили, не получит возврат средств за купленные услуги.</p>
      <br>
      <h3>-Обязательства потребителя-</h3>
      <p>1. Потребитель должен иметь зарегистрированную учетную запись на сервере, на который он будет получать приобретенную услугу.</p>
      <p>2. Потребитель обязан предоставить правильные данные при покупке.</p>
      <p>3. Потребитель обязан сотрудничать с администрацией сервера blackmc.com.pl во время предоставления услуги.</p>
      <p>4. Потребитель, совершающий покупку на сайте blackmc.com.pl, обязан принять условия.</p>
      <br>
      <h3>-Жалоба-</h3>
      <p>1. Потребитель может подать жалобу Продавцу, обратившись по электронной почте: bmcserwer@gmail.com. Жалоба рассматривается в течение 14 дней с момента ее подачи.</p>
      <p>2. Потребитель не имеет права отказаться от договора, если услуга была полностью оказана поставщиком услуги.</p>
      <br>
      <h3>-Заключительные положения-</h3>
      <p>1. Администратор обрабатывает данные на основании Политики конфиденциальности и Политики использования файлов cookie.</p>
      <p>2. Сервер blackmc.com.pl не связан с Mojang AB.</p>
      <p>3. В вопросах, не урегулированных вышеуказанным документом, применяются общеприменимые положения польского законодательства.</p>
      <br>
      <h3>-Информация о предпринимателе-</h3>
      <p>Имя и фамилия: Martin Ramiączek</p>
      <p>Город: Wałbrzych</p>
      <p>Почтовый индекс: 58-316</p>
      <p>Улица: Jana Pawła II 2</p>
      <p>E-mail: bmcserwer@gmail.com</p>
      <p>Деловая активность: незарегистрированная</p>
      <br>
      <p>Положение опубликовано: 21 марта 2021 г.</p>
      <p>Последнее изменение в регламент внесено: 7 сентября 2023 г.</p>
    </div>
  </main>
</template>

<style scoped>

main{
  min-height: calc(100vh - 70px);
  background: url("../components/icons/background-shop.jpg");
  background-size: cover;
  background-position: center;
  display: flex;
  flex-direction: column;
  justify-content: center;
  align-items: center;
  color: #fff;
  font-size: 19px;
}

.container{
  width: 85%;
  padding: 100px 50px 20px 50px;
  background: rgba(0,0,0,0.5);
}

h2{
  text-align: center;
  font-size: 36px;
}

</style>

<script setup>
import { onMounted } from 'vue'

onMounted(() => {
  window.scrollTo(0, 0) // прокрутить страницу вверх при загрузке
})
</script>
